%% getThuOC函数，获取大拇指特征点原始坐标数据(分别为：CMC、MCP、IP、TIP)
function [P0_CMC,P0_MCP,P0_IP,P0_TIP,P0_mid_MCP,P0_mid_PIP]=getOC(A)
%% 获取大拇指特征点原始坐标数据(分别为：CMC、MCP、IP、TIP)
x00=A(:,4);%大拇指CMC关节坐标
y00=-A(:,5); %将Y轴取反，虽然在prcessiong的输出中将Z轴和Y轴对调，但是不符合右手定则，还需要将Y轴取反，使之符合右手定则，同时也符合我们要建立的新坐标系
z00=A(:,6);
x01=A(:,7);%大拇指MCP关节坐标
y01=-A(:,8);
z01=A(:,9);
x02=A(:,10);%大拇指IP关节坐标
y02=-A(:,11);
z02=A(:,12);
x03=A(:,13);%大拇指TIP关节坐标
y03=-A(:,14);
z03=A(:,15);

%原始坐标系下拇指特征点坐标
P0_CMC=[x00'; y00'; z00'];
P0_MCP=[x01'; y01'; z01'];
P0_IP =[x02'; y02'; z02'];
P0_TIP=[x03'; y03'; z03'];

%% 获取中指特征点原始坐标数据（分别为：MCP、PIP）
x20=A(:,28);%中指MCP关节坐标
y20=-A(:,29);
z20=A(:,30);
x21=A(:,31);%中指PIP关节坐标
y21=-A(:,32);
z21=A(:,33);

P0_mid_MCP=[x20'; y20'; z20'];
P0_mid_PIP=[x21'; y21'; z21'];